# Assignment 2 (Machine Learning)
> This assignment is solved by:-
* Name: Vishal Sehgal
* Group: CO11
* Roll Number: 102003265

### Q1

> a. & b.

In [51]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [52]:
df1 = pd.read_csv('./data assig 2/AWCustomers.csv')
df2 = pd.read_csv('./data assig 2/AWSales.csv')
df3 = pd.read_csv('./data assig 2/AWTest-Classification.csv')
df4 = pd.read_csv('./data assig 2/AWTest-Regression.csv')

In [53]:
df1.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,21173,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,Wollongong,New South Wales,...,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,13249,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,Shawnee,British Columbia,...,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,29350,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,West Covina,California,...,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,13503,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,Liverpool,England,...,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,22803,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,Werne,Nordrhein-Westfalen,...,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06

In [54]:
df2.head()

   CustomerID  BikeBuyer  AvgMonthSpend
0       21173          1          50.97
1       13249          1          53.11
2       29350          1          54.08
3       13503          1          56.93
4       22803          1          55.41

In [55]:
df3.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,11219,NaN,Charles,NaN,Cook,NaN,6871 Bel Air Dr.,NaN,Woodburn,Oregon,...,High School,Skilled Manual,M,M,1,2,2,2,56100,2017-03-06
1,11241,NaN,Lisa,NaN,Cai,NaN,"102, rue de Berri",NaN,Les Ulis,Essonne,...,Partial College,Skilled Manual,F,S,1,0,0,0,61555,2017-03-06
2,11352,NaN,Raymond,A,Rodriguez,NaN,"24, impasse Ste-Madeleine",NaN,Pantin,Seine Saint Denis,...,Partial College,Clerical,M,M,1,3,0,2,83613,2017-03-06
3,11904,NaN,Kaylee,NaN,Cook,NaN,5742 Curtis Drive,NaN,Geelong,Victoria,...,Graduate Degree,Professional,F,S,1,2,0,0,130551,2017-03-06
4,11908,NaN,Rafael,A,Tang,NaN,8839 Leonard Dr,NaN,South Melbourne,Victoria,...,Graduate Degree,Professional,M,S,1,2,0,0,135915,2017-03-06

In [56]:
df4.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,11908,NaN,Rafael,A,Tang,NaN,8839 Leonard Dr,NaN,South Melbourne,Victoria,...,Graduate Degree,Professional,M,S,1,2,0,0,135915,2017-03-06
1,12286,NaN,Nathan,M,Jenkins,NaN,3093 Roland Drive,NaN,Peterborough,England,...,Graduate Degree,Professional,M,S,1,2,0,0,137732,2017-03-06
2,12892,NaN,Brian,NaN,Peterson,NaN,1284 Poppy Pl.,NaN,Royal Oak,British Columbia,...,Graduate Degree,Professional,M,M,1,2,0,0,135404,2017-03-06
3,14698,NaN,Diane,NaN,Navarro,NaN,Potsdamer Straße 92324,NaN,Frankfurt am Main,Saarland,...,Bachelors,Management,F,M,1,3,0,0,104040,2017-03-06
4,15085,NaN,Kristin,H,Jai,NaN,"88, impasse Notre-Dame",NaN,Morangis,Essonne,...,Graduate Degree,Professional,F,S,1,0,0,0,129319,2017-03-06

In [57]:
df1.columns

Index(['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix',
       'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName',
       'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate',
       'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag',
       'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren',
       'YearlyIncome', 'LastUpdated'],
      dtype='object')

In [58]:
df2.columns

Index(['CustomerID', 'BikeBuyer', 'AvgMonthSpend'], dtype='object')

In [59]:
df3.columns

Index(['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix',
       'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName',
       'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate',
       'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag',
       'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren',
       'YearlyIncome', 'LastUpdated'],
      dtype='object')

In [60]:
df4.columns

Index(['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix',
       'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName',
       'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate',
       'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag',
       'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren',
       'YearlyIncome', 'LastUpdated'],
      dtype='object')

In [61]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            50 non-null     int64
 1   Title                 0 non-null      float64
 2   FirstName             50 non-null     object
 3   MiddleName            28 non-null     object
 4   LastName              50 non-null     object
 5   Suffix                0 non-null      float64
 6   AddressLine1          50 non-null     object
 7   AddressLine2          0 non-null      float64
 8   City                  50 non-null     object
 9   StateProvinceName     50 non-null     object
 10  CountryRegionName     50 non-null     object
 11  PostalCode            50 non-null     object
 12  PhoneNumber           50 non-null     object
 13  BirthDate             50 non-null     object
 14  Education             50 non-null     object
 15  Occupation            50 non-null     object
 16  Gender                50 non-null     object
 17  MaritalStatus         50 non-null     object
 18  HomeOwnerFlag         50 non-null     int64
 19  NumberCarsOwned       50 non-null     int64
 20  NumberChildrenAtHome  50 non-null     int64
 21  TotalChildren         50 non-null     int64
 22  YearlyIncome          50 non-null     int64
 23  LastUpdated           50 non-null     object
dtypes: float64(3), int64(6), object(15)
memory usage: 9.5+ KB

In [62]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            25 non-null     int64
 1   Title                 0 non-null      float64
 2   FirstName             25 non-null     object
 3   MiddleName            19 non-null     object
 4   LastName              25 non-null     object
 5   Suffix                0 non-null      float64
 6   AddressLine1          25 non-null     object
 7   AddressLine2          0 non-null      float64
 8   City                  25 non-null     object
 9   StateProvinceName     25 non-null     object
 10  CountryRegionName     25 non-null     object
 11  PostalCode            25 non-null     object
 12  PhoneNumber           25 non-null     object
 13  BirthDate             25 non-null     object
 14  Education             25 non-null     object
 15  Occupation            25 non-null     object
 16  Gender                25 non-null     object
 17  MaritalStatus         25 non-null     object
 18  HomeOwnerFlag         25 non-null     int64
 19  NumberCarsOwned       25 non-null     int64
 20  NumberChildrenAtHome  25 non-null     int64
 21  TotalChildren         25 non-null     int64
 22  YearlyIncome          25 non-null     int64
 23  LastUpdated           25 non-null     object
dtypes: float64(3), int64(6), object(15)
memory usage: 4.8+ KB

In [63]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18355 entries, 0 to 18354
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CustomerID     18355 non-null  int64
 1   BikeBuyer      18355 non-null  int64
 2   AvgMonthSpend  18355 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 430.3 KB

In [64]:
df2['BikeBuyer'].unique()

array([1, 0])

In [65]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18361 entries, 0 to 18360
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   Title                 101 non-null    object
 2   FirstName             18361 non-null  object
 3   MiddleName            10572 non-null  object
 4   LastName              18361 non-null  object
 5   Suffix                3 non-null      object
 6   AddressLine1          18361 non-null  object
 7   AddressLine2          311 non-null    object
 8   City                  18361 non-null  object
 9   StateProvinceName     18361 non-null  object
 10  CountryRegionName     18361 non-null  object
 11  PostalCode            18361 non-null  object
 12  PhoneNumber           18361 non-null  object
 13  BirthDate             18361 non-null  object
 14  Education             18361 non-null  object
 15  Occupation            18361 non-null  object
 16  Gender                18361 non-null  object
 17  MaritalStatus         18361 non-null  object
 18  HomeOwnerFlag         18361 non-null  int64
 19  NumberCarsOwned       18361 non-null  int64
 20  NumberChildrenAtHome  18361 non-null  int64
 21  TotalChildren         18361 non-null  int64
 22  YearlyIncome          18361 non-null  int64
 23  LastUpdated           18361 non-null  object
dtypes: int64(6), object(18)
memory usage: 3.4+ MB

> Merging the two df1 and df2 having same CustomerID

In [66]:
df = df2.merge(df1, left_on='CustomerID', right_on='CustomerID', how='left')

In [67]:
df.head()

,CustomerID,BikeBuyer,AvgMonthSpend,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,21173,1,50.97,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,...,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,13249,1,53.11,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,...,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,29350,1,54.08,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,...,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,13503,1,56.93,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,...,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,22803,1,55.41,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,...,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 26 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   BikeBuyer             18361 non-null  int64
 2   AvgMonthSpend         18361 non-null  float64
 3   Title                 101 non-null    object
 4   FirstName             18361 non-null  object
 5   MiddleName            10572 non-null  object
 6   LastName              18361 non-null  object
 7   Suffix                3 non-null      object
 8   AddressLine1          18361 non-null  object
 9   AddressLine2          311 non-null    object
 10  City                  18361 non-null  object
 11  StateProvinceName     18361 non-null  object
 12  CountryRegionName     18361 non-null  object
 13  PostalCode            18361 non-null  object
 14  PhoneNumber           18361 non-null  object
 15  BirthDate             18361 non-null  object
 16  Education             18361 non-null  object
 17  Occupation            18361 non-null  object
 18  Gender                18361 non-null  object
 19  MaritalStatus         18361 non-null  object
 20  HomeOwnerFlag         18361 non-null  int64
 21  NumberCarsOwned       18361 non-null  int64
 22  NumberChildrenAtHome  18361 non-null  int64
 23  TotalChildren         18361 non-null  int64
 24  YearlyIncome          18361 non-null  int64
 25  LastUpdated           18361 non-null  object
dtypes: float64(1), int64(7), object(18)
memory usage: 3.8+ MB

In [69]:
df.columns

Index(['CustomerID', 'BikeBuyer', 'AvgMonthSpend', 'Title', 'FirstName',
       'MiddleName', 'LastName', 'Suffix', 'AddressLine1', 'AddressLine2',
       'City', 'StateProvinceName', 'CountryRegionName', 'PostalCode',
       'PhoneNumber', 'BirthDate', 'Education', 'Occupation', 'Gender',
       'MaritalStatus', 'HomeOwnerFlag', 'NumberCarsOwned',
       'NumberChildrenAtHome', 'TotalChildren', 'YearlyIncome', 'LastUpdated'],
      dtype='object')

In [70]:
df.corr()['BikeBuyer']

CustomerID             -0.021610
BikeBuyer               1.000000
AvgMonthSpend           0.280268
HomeOwnerFlag           0.229115
NumberCarsOwned         0.185078
NumberChildrenAtHome    0.359777
TotalChildren           0.209479
YearlyIncome            0.249457
Name: BikeBuyer, dtype: float64

In [71]:
len(df['Title'].unique()), len(df['FirstName'].unique()), len(df['MiddleName'].unique()), len(df['LastName'].unique())

(6, 670, 45, 375)

> It's clear that FirstName, MiddleName and LastName has to be removed due to high number of unique values in the Natural Language and cannot be hot line encoded

In [72]:
df.drop(['FirstName', 'MiddleName', 'LastName'], axis=1, inplace=True)

In [73]:
len(df['Suffix'].unique()), len(df['AddressLine1'].unique()), len(df['AddressLine2'].unique()), len(df['City'].unique())

(2, 12742, 167, 269)

> It's clear that AddressLine1, AddressLine2 and City has to be removed due to high number of unique values in the Natural Language and cannot be hot line encoded

In [74]:
df.drop(['City', 'AddressLine1', 'AddressLine2'], axis=1, inplace=True)

In [75]:
df.columns

Index(['CustomerID', 'BikeBuyer', 'AvgMonthSpend', 'Title', 'Suffix',
       'StateProvinceName', 'CountryRegionName', 'PostalCode', 'PhoneNumber',
       'BirthDate', 'Education', 'Occupation', 'Gender', 'MaritalStatus',
       'HomeOwnerFlag', 'NumberCarsOwned', 'NumberChildrenAtHome',
       'TotalChildren', 'YearlyIncome', 'LastUpdated'],
      dtype='object')

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 20 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   BikeBuyer             18361 non-null  int64
 2   AvgMonthSpend         18361 non-null  float64
 3   Title                 101 non-null    object
 4   Suffix                3 non-null      object
 5   StateProvinceName     18361 non-null  object
 6   CountryRegionName     18361 non-null  object
 7   PostalCode            18361 non-null  object
 8   PhoneNumber           18361 non-null  object
 9   BirthDate             18361 non-null  object
 10  Education             18361 non-null  object
 11  Occupation            18361 non-null  object
 12  Gender                18361 non-null  object
 13  MaritalStatus         18361 non-null  object
 14  HomeOwnerFlag         18361 non-null  int64
 15  NumberCarsOwned       18361 non-null  int64
 16  NumberChildrenAtHome  18361 non-null  int64
 17  TotalChildren         18361 non-null  int64
 18  YearlyIncome          18361 non-null  int64
 19  LastUpdated           18361 non-null  object
dtypes: float64(1), int64(7), object(12)
memory usage: 2.9+ MB

In [77]:
len(df['StateProvinceName'].unique()), len(df['CountryRegionName'].unique()), len(df['PostalCode'].unique()), len(df['PhoneNumber'].unique())

(54, 6, 323, 8836)

> It's clear that StateProvinceName, PostalCode and PhoneNumber has to be removed due to high number of unique values in the Natural Language and cannot be hot line encoded

In [78]:
df.drop(['StateProvinceName', 'PostalCode', 'PhoneNumber'], axis=1, inplace=True)

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 17 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   BikeBuyer             18361 non-null  int64
 2   AvgMonthSpend         18361 non-null  float64
 3   Title                 101 non-null    object
 4   Suffix                3 non-null      object
 5   CountryRegionName     18361 non-null  object
 6   BirthDate             18361 non-null  object
 7   Education             18361 non-null  object
 8   Occupation            18361 non-null  object
 9   Gender                18361 non-null  object
 10  MaritalStatus         18361 non-null  object
 11  HomeOwnerFlag         18361 non-null  int64
 12  NumberCarsOwned       18361 non-null  int64
 13  NumberChildrenAtHome  18361 non-null  int64
 14  TotalChildren         18361 non-null  int64
 15  YearlyIncome          18361 non-null  int64
 16  LastUpdated           18361 non-null  object
dtypes: float64(1), int64(7), object(9)
memory usage: 2.5+ MB

In [80]:
len(df['BirthDate'].unique()), len(df['Education'].unique()), len(df['Occupation'].unique()), len(df['Gender'].unique())

(8230, 5, 5, 2)

In [81]:
len(df['MaritalStatus'].unique()), len(df['LastUpdated'].unique())

(2, 2)

> It's clear that BirthDate has to be removed due to high number of unique values in the Natural Language and cannot be hot line encoded

In [82]:
df.drop('BirthDate', axis=1, inplace=True)

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 16 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   BikeBuyer             18361 non-null  int64
 2   AvgMonthSpend         18361 non-null  float64
 3   Title                 101 non-null    object
 4   Suffix                3 non-null      object
 5   CountryRegionName     18361 non-null  object
 6   Education             18361 non-null  object
 7   Occupation            18361 non-null  object
 8   Gender                18361 non-null  object
 9   MaritalStatus         18361 non-null  object
 10  HomeOwnerFlag         18361 non-null  int64
 11  NumberCarsOwned       18361 non-null  int64
 12  NumberChildrenAtHome  18361 non-null  int64
 13  TotalChildren         18361 non-null  int64
 14  YearlyIncome          18361 non-null  int64
 15  LastUpdated           18361 non-null  object
dtypes: float64(1), int64(7), object(8)
memory usage: 2.4+ MB

> Title and Suffix has to be also dropped due to very low amount of data present.

In [84]:
df.drop(['Title', 'Suffix'], axis=1, inplace=True)

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   BikeBuyer             18361 non-null  int64
 2   AvgMonthSpend         18361 non-null  float64
 3   CountryRegionName     18361 non-null  object
 4   Education             18361 non-null  object
 5   Occupation            18361 non-null  object
 6   Gender                18361 non-null  object
 7   MaritalStatus         18361 non-null  object
 8   HomeOwnerFlag         18361 non-null  int64
 9   NumberCarsOwned       18361 non-null  int64
 10  NumberChildrenAtHome  18361 non-null  int64
 11  TotalChildren         18361 non-null  int64
 12  YearlyIncome          18361 non-null  int64
 13  LastUpdated           18361 non-null  object
dtypes: float64(1), int64(7), object(6)
memory usage: 2.1+ MB

In [86]:
df.corr()['BikeBuyer']

CustomerID             -0.021610
BikeBuyer               1.000000
AvgMonthSpend           0.280268
HomeOwnerFlag           0.229115
NumberCarsOwned         0.185078
NumberChildrenAtHome    0.359777
TotalChildren           0.209479
YearlyIncome            0.249457
Name: BikeBuyer, dtype: float64

> CustomerID can be removed due to nearly zero correlation score with BikeBuyer

In [87]:
df.drop('CustomerID', axis=1, inplace=True)

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   BikeBuyer             18361 non-null  int64
 1   AvgMonthSpend         18361 non-null  float64
 2   CountryRegionName     18361 non-null  object
 3   Education             18361 non-null  object
 4   Occupation            18361 non-null  object
 5   Gender                18361 non-null  object
 6   MaritalStatus         18361 non-null  object
 7   HomeOwnerFlag         18361 non-null  int64
 8   NumberCarsOwned       18361 non-null  int64
 9   NumberChildrenAtHome  18361 non-null  int64
 10  TotalChildren         18361 non-null  int64
 11  YearlyIncome          18361 non-null  int64
 12  LastUpdated           18361 non-null  object
dtypes: float64(1), int64(6), object(6)
memory usage: 2.0+ MB

> c.

In [89]:
print(df['BikeBuyer'].unique())
print(len(df['AvgMonthSpend'].unique()))
print(df['CountryRegionName'].unique())
print(df['Education'].unique())
print(df['Occupation'].unique())
print(df['Gender'].unique())
print(df['MaritalStatus'].unique())
print(df['HomeOwnerFlag'].unique())
print(df['NumberCarsOwned'].unique())
print(df['NumberChildrenAtHome'].unique())
print(df['TotalChildren'].unique())
print(len(df['YearlyIncome'].unique()))
print(df['LastUpdated'].unique())

[1 0]
1803
['Australia' 'Canada' 'United States' 'United Kingdom' 'Germany' 'France']
['Bachelors' 'Partial College' 'High School' 'Partial High School'
 'Graduate Degree']
['Clerical' 'Skilled Manual' 'Manual' 'Management' 'Professional']
['M' 'F']
['M' 'S']
[1 0]
[3 2 1 0 4 5]
[0 1 2 3]
[1 2 0 3]
15356
['2017-03-06' '2017-03-07']

* BikeBuyer -> Discrete / Nominal
* AvgMonthSpend -> Continuous / Interval
* CountryRegionName -> Discrete / Nominal
* Education -> Discrete / Ordinal
* Occupation -> Discrete / Nominal
* Gender -> Discrete / Nominal
* MaritalStatus -> Discrete / Nominal
* HomeOwnerFlag -> Discrete / Nominal
* NumberCarsOwned -> Discrete / Nominal
* NumberChildrenAtHome -> Discrete / Nominal
* TotalChildren -> Discrete / Nominal
* YearlyIncome -> Continuous / Interval
* LastUpdated -> Discrete / Nominal

### Q2

> a. Already handled in first question and the proof is below

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   BikeBuyer             18361 non-null  int64
 1   AvgMonthSpend         18361 non-null  float64
 2   CountryRegionName     18361 non-null  object
 3   Education             18361 non-null  object
 4   Occupation            18361 non-null  object
 5   Gender                18361 non-null  object
 6   MaritalStatus         18361 non-null  object
 7   HomeOwnerFlag         18361 non-null  int64
 8   NumberCarsOwned       18361 non-null  int64
 9   NumberChildrenAtHome  18361 non-null  int64
 10  TotalChildren         18361 non-null  int64
 11  YearlyIncome          18361 non-null  int64
 12  LastUpdated           18361 non-null  object
dtypes: float64(1), int64(6), object(6)
memory usage: 2.0+ MB

> b.

In [91]:
# 1. BikeBuyer is our target so we don't need to normalize that column (classification problem)
# 2. AvgMonthSpend can be noramlized. We perform maximum normalization on this column.
print(df['AvgMonthSpend'].max())
df['AvgMonthSpend'] = df['AvgMonthSpend']/df['AvgMonthSpend'].max()
print(df['AvgMonthSpend'])

65.29
0        0.780671
1        0.813448
2        0.828304
3        0.871956
4        0.848675
           ...
18356    0.737326
18357    0.769337
18358    0.759075
18359    0.787563
18360    0.800582
Name: AvgMonthSpend, Length: 18361, dtype: float64

In [92]:
# 3. CountryRegionName, Education, Occupation, Gender, MaritalStatus and LastUpdated need to be hot-line encoded
# 4. HomeOwnerFlag are binary in nature therefore no need to normalize it.
# 5. NumberCarsOwned can be noramlized. We perform maximum normalization on this column.
print(df['NumberCarsOwned'].max())
df['NumberCarsOwned'] = df['NumberCarsOwned']/df['NumberCarsOwned'].max()
print(df['NumberCarsOwned'])

5
0        0.6
1        0.4
2        0.6
3        0.4
4        0.2
        ...
18356    0.2
18357    0.4
18358    0.4
18359    0.0
18360    0.4
Name: NumberCarsOwned, Length: 18361, dtype: float64

In [93]:
# 6. NumberChildrenAtHome can be noramlized. We perform maximum normalization on this column.
print(df['NumberChildrenAtHome'].max())
df['NumberChildrenAtHome'] = df['NumberChildrenAtHome']/df['NumberChildrenAtHome'].max()
print(df['NumberChildrenAtHome'])

3
0        0.000000
1        0.333333
2        0.000000
3        0.333333
4        0.000000
           ...
18356    0.000000
18357    0.000000
18358    0.000000
18359    0.000000
18360    0.000000
Name: NumberChildrenAtHome, Length: 18361, dtype: float64

In [94]:
# 7. TotalChildren can be noramlized. We perform maximum normalization on this column.
print(df['TotalChildren'].max())
df['TotalChildren'] = df['TotalChildren']/df['TotalChildren'].max()
print(df['TotalChildren'])

3
0        0.333333
1        0.666667
2        0.000000
3        0.666667
4        0.000000
           ...
18356    0.666667
18357    0.000000
18358    0.000000
18359    0.000000
18360    0.000000
Name: TotalChildren, Length: 18361, dtype: float64

In [95]:
# 7. YearlyIncome can be noramlized. We perform maximum normalization on this column.
print(df['YearlyIncome'].max())
df['YearlyIncome'] = df['YearlyIncome']/df['YearlyIncome'].max()
print(df['YearlyIncome'])

139115
0        0.588837
1        0.582798
2        0.620975
3        0.441944
4        0.372383
           ...
18356    0.380642
18357    0.438429
18358    0.372778
18359    0.626654
18360    0.983762
Name: YearlyIncome, Length: 18361, dtype: float64

In [96]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   BikeBuyer             18361 non-null  int64
 1   AvgMonthSpend         18361 non-null  float64
 2   CountryRegionName     18361 non-null  object
 3   Education             18361 non-null  object
 4   Occupation            18361 non-null  object
 5   Gender                18361 non-null  object
 6   MaritalStatus         18361 non-null  object
 7   HomeOwnerFlag         18361 non-null  int64
 8   NumberCarsOwned       18361 non-null  float64
 9   NumberChildrenAtHome  18361 non-null  float64
 10  TotalChildren         18361 non-null  float64
 11  YearlyIncome          18361 non-null  float64
 12  LastUpdated           18361 non-null  object
dtypes: float64(5), int64(2), object(6)
memory usage: 2.0+ MB

In [97]:
df.describe()

,BikeBuyer,AvgMonthSpend,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome
count,18361.000000,18361.000000,18361.000000,18361.000000,18361.000000,18361.000000,18361.000000
mean,0.551767,0.792874,0.610588,0.254060,0.112721,0.283463,0.522983
std,0.497326,0.052653,0.487630,0.182798,0.189652,0.309105,0.220580
min,0.000000,0.675448,0.000000,0.000000,0.000000,0.000000,0.182834
25%,0.000000,0.756777,0.000000,0.200000,0.000000,0.000000,0.383223
50%,1.000000,0.787563,1.000000,0.200000,0.000000,0.000000,0.444603
75%,1.000000,0.820800,1.000000,0.400000,0.333333,0.666667,0.628329
max,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

> e.

In [100]:
country = pd.get_dummies(df['CountryRegionName'], drop_first=True)

In [101]:
education = pd.get_dummies(df['Education'], drop_first=True)

In [102]:
occupation = pd.get_dummies(df['Occupation'], drop_first=True)

In [103]:
gender = pd.get_dummies(df['Gender'], drop_first=True)

In [104]:
maritalStatus = pd.get_dummies(df['MaritalStatus'], drop_first=True)

In [106]:
lastupdated = pd.get_dummies(df['LastUpdated'], drop_first=True)

In [109]:
df = pd.concat([df, country, education, occupation, gender, maritalStatus, lastupdated], axis=1)

In [111]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 29 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   BikeBuyer             18361 non-null  int64
 1   AvgMonthSpend         18361 non-null  float64
 2   CountryRegionName     18361 non-null  object
 3   Education             18361 non-null  object
 4   Occupation            18361 non-null  object
 5   Gender                18361 non-null  object
 6   MaritalStatus         18361 non-null  object
 7   HomeOwnerFlag         18361 non-null  int64
 8   NumberCarsOwned       18361 non-null  float64
 9   NumberChildrenAtHome  18361 non-null  float64
 10  TotalChildren         18361 non-null  float64
 11  YearlyIncome          18361 non-null  float64
 12  LastUpdated           18361 non-null  object
 13  Canada                18361 non-null  uint8
 14  France                18361 non-null  uint8
 15  Germany               18361 non-null  uint8
 16  United Kingdom        18361 non-null  uint8
 17  United States         18361 non-null  uint8
 18  Graduate Degree       18361 non-null  uint8
 19  High School           18361 non-null  uint8
 20  Partial College       18361 non-null  uint8
 21  Partial High School   18361 non-null  uint8
 22  Management            18361 non-null  uint8
 23  Manual                18361 non-null  uint8
 24  Professional          18361 non-null  uint8
 25  Skilled Manual        18361 non-null  uint8
 26  M                     18361 non-null  uint8
 27  S                     18361 non-null  uint8
 28  2017-03-07            18361 non-null  uint8
dtypes: float64(5), int64(2), object(6), uint8(16)
memory usage: 2.2+ MB

In [116]:
df.drop(['CountryRegionName', 'Education', 'Occupation', 'Gender', 'MaritalStatus', 'LastUpdated'], axis=1, inplace=True)

In [117]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 23 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   BikeBuyer             18361 non-null  int64
 1   AvgMonthSpend         18361 non-null  float64
 2   HomeOwnerFlag         18361 non-null  int64
 3   NumberCarsOwned       18361 non-null  float64
 4   NumberChildrenAtHome  18361 non-null  float64
 5   TotalChildren         18361 non-null  float64
 6   YearlyIncome          18361 non-null  float64
 7   Canada                18361 non-null  uint8
 8   France                18361 non-null  uint8
 9   Germany               18361 non-null  uint8
 10  United Kingdom        18361 non-null  uint8
 11  United States         18361 non-null  uint8
 12  Graduate Degree       18361 non-null  uint8
 13  High School           18361 non-null  uint8
 14  Partial College       18361 non-null  uint8
 15  Partial High School   18361 non-null  uint8
 16  Management            18361 non-null  uint8
 17  Manual                18361 non-null  uint8
 18  Professional          18361 non-null  uint8
 19  Skilled Manual        18361 non-null  uint8
 20  M                     18361 non-null  uint8
 21  S                     18361 non-null  uint8
 22  2017-03-07            18361 non-null  uint8
dtypes: float64(5), int64(2), uint8(16)
memory usage: 1.4 MB

### Q3

> a.

In [132]:
from sklearn.metrics.pairwise import cosine_similarity
from sklearn.metrics import jaccard_score

In [137]:
from sklearn.metrics import accuracy_score
print(f"Similarity in Simple Matching {accuracy_score(np.array(df['BikeBuyer']), np.array(df['Skilled Manual']))}")

Similarity in Simple Matching 0.4871739012036381

In [138]:
print(f"Jaccard Similarity: {jaccard_score(np.array(df['BikeBuyer']), np.array(df['Skilled Manual']))}")

Jaccard Similarity: 0.2645473717097555

In [130]:
cosine_similarity(df)

array([[1.        , 0.81427587, 0.53556619, ..., 0.40236336, 0.23340862,
        0.62917959],
       [0.81427587, 1.        , 0.41710225, ..., 0.47671859, 0.3863517 ,
        0.50195541],
       [0.53556619, 0.41710225, 1.        , ..., 0.80355098, 0.48409194,
        0.6416018 ],
       ...,
       [0.40236336, 0.47671859, 0.80355098, ..., 1.        , 0.37717837,
        0.49704426],
       [0.23340862, 0.3863517 , 0.48409194, ..., 0.37717837, 1.        ,
        0.23926372],
       [0.62917959, 0.50195541, 0.6416018 , ..., 0.49704426, 0.23926372,
        1.        ]])

> b.

In [119]:
df.corr()['YearlyIncome']

BikeBuyer               0.249457
AvgMonthSpend           0.530126
HomeOwnerFlag           0.356243
NumberCarsOwned         0.477300
NumberChildrenAtHome    0.005990
TotalChildren           0.022014
YearlyIncome            1.000000
Canada                 -0.007440
France                 -0.065011
Germany                -0.033813
United Kingdom         -0.008846
United States           0.056997
Graduate Degree         0.284948
High School            -0.240515
Partial College        -0.061270
Partial High School    -0.283464
Management              0.487918
Manual                 -0.642032
Professional            0.608608
Skilled Manual         -0.368936
M                      -0.000354
S                      -0.048784
2017-03-07              0.002159
Name: YearlyIncome, dtype: float64

In [122]:
df.describe()

,BikeBuyer,AvgMonthSpend,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,Canada,France,Germany,...,High School,Partial College,Partial High School,Management,Manual,Professional,Skilled Manual,M,S,2017-03-07
count,18361.000000,18361.000000,18361.000000,18361.000000,18361.000000,18361.000000,18361.000000,18361.000000,18361.000000,18361.000000,...,18361.000000,18361.000000,18361.000000,18361.000000,18361.000000,18361.000000,18361.000000,18361.00000,18361.000000,18361.000000
mean,0.551767,0.792874,0.610588,0.254060,0.112721,0.283463,0.522983,0.084745,0.097762,0.096291,...,0.178313,0.273623,0.085780,0.155656,0.183922,0.087305,0.329993,0.50580,0.458254,0.003812
std,0.497326,0.052653,0.487630,0.182798,0.189652,0.309105,0.220580,0.278509,0.297000,0.294998,...,0.382786,0.445830,0.280046,0.362539,0.387431,0.282289,0.470223,0.49998,0.498268,0.061629
min,0.000000,0.675448,0.000000,0.000000,0.000000,0.000000,0.182834,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000
25%,0.000000,0.756777,0.000000,0.200000,0.000000,0.000000,0.383223,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000
50%,1.000000,0.787563,1.000000,0.200000,0.000000,0.000000,0.444603,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.00000,0.000000,0.000000
75%,1.000000,0.820800,1.000000,0.400000,0.333333,0.666667,0.628329,0.000000,0.000000,0.000000,...,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,1.000000,1.00000,1.000000,0.000000
max,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.00000,1.000000,1.000000